While making curved beam type "[Type Name]" some Reference Line elements were not created
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NotBentRefLine { get; }
  Visual Basic
Public Shared ReadOnly Property NotBentRefLine As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NotBentRefLine {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures BendFailures Class
  Autodesk.Revit.DB Namespace